import numpy as np

##############################################
#花式索引返回的是对原对象复制而不是引用

#一维花式索引

##用arange生成等差数组
a = np.arange(0, 100, 10)
print("等差数组为：", end = '')
print(a)

#花式索引
index = [1, 2, -3]
print("花式索引的结果为：", end = '')
print(a[index])

#用布尔数组花式索引
##元素个数需跟被索引数组相同
mask = np.array([0, 2, 2, 0, 0, 1, 0, 0, 1, 0], dtype=bool)
print("布尔花式索引的结果为：", end = '')
print(a[mask])

##############################################

#二维花式索引
b = np.array([[0, 1, 2, 3, 4, 5], [10, 11, 12, 13, 14, 15], [20, 21, 22, 23, 24, 25], [30, 31, 32, 33, 34, 35], [40, 41, 42, 43, 44, 45], [50, 51, 52, 53, 54, 55]])

#想要次对角线上的五个数
print("次对角线上的五个数为：", end = '')
print(b[(0, 1, 2, 3, 4), (1, 2, 3, 4, 5)])

#最后三行的1,3,5列
print("最后三行的1,3,5列为：")
print(b[-3: , ::2])

#布尔索引
mask = np.array([1, 0, 1, 0, 0, 1], dtype=bool)
print("布尔花式索引的结果为：")
print(b[mask, 2])

#不完全索引
#只给定行索引的时候，返回整行
print("第1,2,3行为：")
print(b[:3])

#也可以用花式索引取出一整行
condition = np.array([0, 1, 1, 0, 1, 0], dtype=bool)
print("第2,3,5行为：")
print(b[condition])