import numpy as np

#多维数组操作
a = np.arange(6)
print("原数组为：", end = '')
print(a)

##############################################

#改变形状
a.shape = 2, 3
print("改变形状后的数组为：")
print(a)

#复制后再改变形状（即返回一个新数组）
print("不会修改原数组的值：")
print(a.reshape(2, 3))

##############################################

#转置

#使用transpose不会改变原矩阵
print("转置后的矩阵为：")
print(a.transpose())
print("原矩阵为：")
print(a)

#使用a.T会改变原矩阵
print("转置后的矩阵为：")
print(a.T)

##############################################

